Package-Management.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-12 Wed 20:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Grant Rettke" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org50b1f84">1. Watch What You Eat</a>
<ul>
<li><a href="#orgbb2a65c">1.1. Use-Package</a></li>
<li><a href="#orgcdc201f">1.2. El-Get</a></li>
<li><a href="#org1b766db">1.3. Stand-Alone</a></li>
<li><a href="#orgd96e7b3">1.4. Helper</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Never compile this.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8398c51"><span class="org-comment-delimiter">;; </span><span class="org-comment">-*- no-byte-compile: t; -*-</span>
</pre>
</div>
<div id="outline-container-org50b1f84" class="outline-2">
<h2 id="org50b1f84"><span class="section-number-2">1</span> Watch What You Eat</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:BD133C8B-8DFF-45C0-967D-CB83693C54B4
</pre>
</div>
<div id="outline-container-orgbb2a65c" class="outline-3">
<h3 id="orgbb2a65c"><span class="section-number-3">1.1</span> Use-Package</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
ID: org_gcr_2018-04-11T09-44-43-05-00_mara:55083825-349A-44D0-8026-2E652BE228A9
</pre>
<p>
Configure <code>use-package</code>.
</p>

<p>
Sysop is likely to use this infrequently.
</p>

<p>
Start EMACS with this command:
</p>

<pre class="example">
emacs --debug-init --no-init-file --no-splash --background-color white --foreground-color black --vertical-scroll-bars --eval '(switch-to-buffer "*Messages*")' --name O2B-TEST --title O2B-TEST --load ~/src/help/.org-mode-package-management.emacs.el
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5f3a44e">(load-file <span class="org-string">"~/src/help/.org-mode-fundamentals.emacs.el"</span>)
</pre>
</div>

<p>
<b>Code requiring package-management can only follow this block.</b>
</p>

<p>
Before ELPA, I used SVN to manage software packages for EMACS. After ELPA,
I used ELPA-packages. Now this system uses MELPA and GNU. MELPA packages always
have their issues fixed very quickly. GNU packages rarely have issues.
</p>

<p>
Initialize Package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8146d1a">(package-initialize)
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">package-archives</span>
             <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"melpa"</span> . <span class="org-string">"http://melpa.org/packages/"</span>) t)
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">package-archives</span>
             <span class="org-highlight-quoted-quote">'</span>(<span class="org-string">"gnu"</span> . <span class="org-string">"http://elpa.gnu.org/packages/"</span>) t)
</pre>
</div>

<p>
Use-Package is the most configurable and performant way to manage ELPA
packages. Startup speed matters but not right now so don't use <code>:defer</code>.
</p>

<p>
Add the Use-Package distribution the load path.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgde9b959">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span><span class="org-string">"~/src/use-package"</span>)
</pre>
</div>

<p>
Load Use-Package and it's partner Diminish. Every package loaded before this
point uses <code>require</code>. Every package loaded after this point uses <code>use-package</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org423ab1c">(<span class="org-keyword">eval-when-compile</span>
  (<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">use-package</span>))
(<span class="org-keyword">use-package</span> <span class="org-constant">diminish</span>)
</pre>
</div>
</div>
</div>
