Package-Management.txt
Grant Rettke


Table of Contents
_________________

1. Watch What You Eat
.. 1. Use-Package
.. 2. El-Get
.. 3. Stand-Alone
.. 4. Helper


Never compile this.
,----
| ;; -*- no-byte-compile: t; -*-
`----


1 Watch What You Eat
====================

  ID: org_gcr_2017-05-12_mara:BD133C8B-8DFF-45C0-967D-CB83693C54B4


1.1 Use-Package
~~~~~~~~~~~~~~~

  ID: org_gcr_2018-04-11T09-44-43-05-00_mara:55083825-349A-44D0-8026-2E652BE228A9
  Configure `use-package'.

  Sysop is likely to use this infrequently.

  Start EMACS with this command:

  ,----
  | emacs --debug-init --no-init-file --no-splash --background-color white --foreground-color black --vertical-scroll-bars --eval '(switch-to-buffer "*Messages*")' --name O2B-TEST --title O2B-TEST --load ~/src/help/.org-mode-package-management.emacs.el
  `----

  ,----
  | (load-file "~/src/help/.org-mode-fundamentals.emacs.el")
  `----

  *Code requiring package-management can only follow this block.*

  Before ELPA, I used SVN to manage software packages for EMACS. After ELPA, I
  used ELPA-packages. Now this system uses MELPA and GNU. MELPA packages always
  have their issues fixed very quickly. GNU packages rarely have issues.

  Initialize Package.

  ,----
  | (package-initialize)
  | (add-to-list 'package-archives
  |              '("melpa" . "http://melpa.org/packages/") t)
  | (add-to-list 'package-archives
  |              '("gnu" . "http://elpa.gnu.org/packages/") t)
  `----

  Use-Package is the most configurable and performant way to manage ELPA
  packages. Startup speed matters but not right now so don't use `:defer'.

  Add the Use-Package distribution the load path.

  ,----
  | (add-to-list 'load-path"~/src/use-package")
  `----

  Load Use-Package and it's partner Diminish. Every package loaded before this
  point uses `require'. Every package loaded after this point uses
  `use-package'.

  ,----
  | (eval-when-compile
  |   (require 'use-package))
  | (use-package diminish)
  `----


1.2 El-Get
~~~~~~~~~~
