Package-Management.html
<div id="outline-container-orgcdc201f" class="outline-3">
<h3 id="orgcdc201f"><span class="section-number-3">1.2</span> El-Get</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
ID: org_gcr_2018-04-11T09-44-43-05-00_mara:925A5891-AB13-4972-9C95-3B49B7D47885
</pre>
<p>
EL-Get handles things that don't easily fit anywhere else.
</p>

<p>
Initialize EL-Get.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4699aea">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/.emacs.d/el-get/el-get"</span>)

(<span class="org-keyword">unless</span> (<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">el-get</span> nil <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">noerror</span>)
  (<span class="org-keyword">with-current-buffer</span>
      (url-retrieve-synchronously
       <span class="org-string">"https://raw.githubusercontent.com/dimitri/el-get/master/el-get-install.el"</span>)
    (goto-char (point-max))
    (eval-print-last-sexp)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org98eed99">(<span class="org-keyword">setq</span> help/el-get-packages nil)
</pre>
</div>

<p>
Make it really easy to remind yourself and others what EMACS really stands for
(in this case it is fun).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3abb802">(add-to-list
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">el-get-sources</span>
 <span class="org-highlight-quoted-quote">'</span>(<span class="org-builtin">:name</span> emacs-name
          <span class="org-builtin">:type</span> http
          <span class="org-builtin">:url</span> <span class="org-string">"http://www.splode.com/~friedman/software/emacs-lisp/src/emacs-name.el"</span>
          <span class="org-builtin">:features</span> emacs-name
          <span class="org-builtin">:autoloads</span> nil
          <span class="org-builtin">:website</span> <span class="org-string">"http://www.splode.com/"</span>
          <span class="org-builtin">:description</span> <span class="org-string">"emacs acronym expansions"</span>))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">help/el-get-packages</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">emacs-name</span>)
</pre>
</div>

<p>
It is not good to flame people on the Internet. It is good to <i>know</i> what it is
all about, and here is a way to see some examples of the absurdity of it all.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7408911">(add-to-list
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">el-get-sources</span>
 <span class="org-highlight-quoted-quote">'</span>(<span class="org-builtin">:name</span> flame
          <span class="org-builtin">:type</span> http
          <span class="org-builtin">:url</span> <span class="org-string">"http://www.splode.com/~friedman/software/emacs-lisp/src/flame.el"</span>
          <span class="org-builtin">:features</span> flame
          <span class="org-builtin">:autoloads</span> nil
          <span class="org-builtin">:website</span> <span class="org-string">"http://www.splode.com/"</span>
          <span class="org-builtin">:description</span> <span class="org-string">"automatic generation of flamage, as if we needed more"</span>))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">help/el-get-packages</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">flame</span>)
</pre>
</div>

<p>
People love horoscopes, so, provide them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4d5a0ff">(add-to-list
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">el-get-sources</span>
 <span class="org-highlight-quoted-quote">'</span>(<span class="org-builtin">:name</span> horoscope
          <span class="org-builtin">:type</span> http
          <span class="org-builtin">:url</span> <span class="org-string">"http://www.splode.com/~friedman/software/emacs-lisp/src/horoscope.el"</span>
          <span class="org-builtin">:features</span> horoscope
          <span class="org-builtin">:autoloads</span> t
          <span class="org-builtin">:website</span> <span class="org-string">"http://www.splode.com/"</span>
          <span class="org-builtin">:description</span> <span class="org-string">"generate horoscopes"</span>))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">help/el-get-packages</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">horoscope</span>)
</pre>
</div>

<p>
James Parry <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> must always
be honored.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf5658ef">(add-to-list
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">el-get-sources</span>
 <span class="org-highlight-quoted-quote">'</span>(<span class="org-builtin">:name</span> kibologize
          <span class="org-builtin">:type</span> http
          <span class="org-builtin">:url</span> <span class="org-string">"http://www.splode.com/~friedman/software/emacs-lisp/src/kibologize.el"</span>
          <span class="org-builtin">:features</span> kibologize
          <span class="org-builtin">:autoloads</span> nil
          <span class="org-builtin">:website</span> <span class="org-string">"http://www.splode.com/"</span>
          <span class="org-builtin">:description</span> <span class="org-string">"generate ravings about kibology, in the style of kibo"</span>))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">help/el-get-packages</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">kibologize</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">help/kibologize-insert</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((current-prefix-arg <span class="org-highlight-quoted-quote">'</span>(4)))
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">kibologize</span>)))
</pre>
</div>

<p>
You might not always remember your shopping list, but we will remember it for
you… though not necessarily for wholesale.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org081a212">(add-to-list
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">el-get-sources</span>
 <span class="org-highlight-quoted-quote">'</span>(<span class="org-builtin">:name</span> shop
          <span class="org-builtin">:type</span> http
          <span class="org-builtin">:url</span> <span class="org-string">"http://www.splode.com/~friedman/software/emacs-lisp/src/shop.el"</span>
          <span class="org-builtin">:features</span> shop
          <span class="org-builtin">:autoloads</span> nil
          <span class="org-builtin">:website</span> <span class="org-string">"http://www.splode.com/"</span>
          <span class="org-builtin">:description</span> <span class="org-string">"generate random shopping lists"</span>))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">help/el-get-packages</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">shop</span>)
</pre>
</div>

<p>
Do you remember when those great AT&amp;T adds were on television and it changed
your life and bought you a kitten? You will.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3aff051">(add-to-list
 <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">el-get-sources</span>
 <span class="org-highlight-quoted-quote">'</span>(<span class="org-builtin">:name</span> youwill
          <span class="org-builtin">:type</span> http
          <span class="org-builtin">:url</span> <span class="org-string">"http://www.splode.com/~friedman/software/emacs-lisp/src/youwill.el"</span>
          <span class="org-builtin">:features</span> youwill
          <span class="org-builtin">:autoloads</span> t
          <span class="org-builtin">:website</span> <span class="org-string">"http://www.splode.com/"</span>
          <span class="org-builtin">:description</span> <span class="org-string">"generate meaningless marketing hype"</span>))
(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">help/el-get-packages</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">youwill</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">help/youwill-insert</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((current-prefix-arg <span class="org-highlight-quoted-quote">'</span>(4)))
    (call-interactively <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">youwill</span>)))
</pre>
</div>

<p>
Ask el-get to make sure that those desired packages are installed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf36e8e7">(el-get <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">sync</span> help/el-get-packages)
</pre>
</div>
</div>
</div>
